{"config": [{"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2], "batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32"}}, {"class_name": "Lambda", "config": {"trainable": true, "name": "lambda_2", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-56-4066456faf37>\u00da\b<lambda>\n\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_6", "nb_row": 5, "nb_filter": 24, "nb_col": 5, "subsample": [1, 1], "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_7", "nb_row": 5, "nb_filter": 36, "nb_col": 5, "subsample": [1, 1], "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_8", "nb_row": 5, "nb_filter": 48, "nb_col": 5, "subsample": [1, 1], "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_9", "nb_row": 3, "nb_filter": 64, "nb_col": 3, "subsample": [1, 1], "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_10", "nb_row": 3, "nb_filter": 64, "nb_col": 3, "subsample": [1, 1], "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 100, "W_regularizer": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "dense_5", "input_dim": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 50, "W_regularizer": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "dense_6", "input_dim": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_15"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 10, "W_regularizer": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "dense_7", "input_dim": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_16"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "W_regularizer": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "name": "dense_8", "input_dim": null, "W_constraint": null}}], "keras_version": "1.1.2", "class_name": "Sequential"}